app/views/students/index.html.haml

SELECT "groups".* FROM "groups" INNER JOIN "group_students" ON "groups"."id" = "group_students"."group_id" WHERE "group_students"."student_id" = $1  [["student_id", 1]]
---
        %td= student.passport_series
        %td= raw(student.groups.map{ |g| link_to(g.title, group_path(g)) }.join(', '))