app/views/students/show_for_students.html.haml

  %ul
    - @student.groups.each do |gr|
---
SELECT "groups".* FROM "groups" INNER JOIN "group_students" ON "groups"."id" = "group_students"."group_id" WHERE "group_students"."student_id" = $1  [["student_id", 1]]