app/views/groups/show.html.haml

  %ul
    - @group.students.each do |st|
---
SELECT "students".* FROM "students" INNER JOIN "group_students" ON "students"."id" = "group_students"."student_id" WHERE "group_students"."group_id" = $1  [["group_id", 6]]