app/views/community_users/_form.html.haml

    = f.label :typeuser
    = f.select :typeuser, [["Модератор", 0], ["Редактор", 1], ["Читатель", 2]]
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]