app/views/community_pages/index.html.haml

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      %tr
        %td= community_page.page