app/views/community_pages/show.html.haml

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  %b Страница:
  = link_to @community_page.page.header