app/views/subjects/show_for_students.html.haml

SELECT  "pages".* FROM "pages" INNER JOIN "page_subjects" ON "pages"."id" = "page_subjects"."page_id" WHERE "page_subjects"."subject_id" = $1  ORDER BY "pages"."id" ASC LIMIT 1  [["subject_id", 3]]
SELECT COUNT(*) FROM "pages" INNER JOIN "page_subjects" ON "pages"."id" = "page_subjects"."page_id" WHERE "page_subjects"."subject_id" = $1  [["subject_id", 3]]
---
%p
  = markdown(@subject.pages.first.try(:contents).to_s)