app/views/subjects/show.html.haml

%p
  = markdown(@subject.pages.first.try(:contents).to_s)
---
SELECT  "pages".* FROM "pages" INNER JOIN "page_subjects" ON "pages"."id" = "page_subjects"."page_id" WHERE "page_subjects"."subject_id" = $1  ORDER BY "pages"."id" ASC LIMIT 1  [["subject_id", 5]]