app/controllers/community_users_controller.rb

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 AND "role_users"."id" = $2 ORDER BY "role_users"."id" ASC LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT "community_users".* FROM "community_users"
---
  def index
    @community_users = CommunityUser.all

INSERT INTO "community_users" ("user_id", "community_id", "typeuser", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["community_id", 1], ["typeuser", 0], ["created_at", 2016-05-21 10:22:00 UTC], ["updated_at", 2016-05-21 10:22:00 UTC]]
---
  def create
    @community_user = CommunityUser.new(community_user_params)

    respond_to do |format|
      if @community_user.save

UPDATE "community_users" SET "user_id" = $1, "community_id" = $2, "updated_at" = $3 WHERE "community_users"."id" = $4  [["user_id", 1], ["community_id", 1], ["updated_at", 2016-05-14 11:12:12 UTC], ["id", 1]]
UPDATE "users" SET "last_activity_at" = '2016-05-14 11:12:12.435775' WHERE "users"."id" = $1  [["id", 1]]
---
  def update
    respond_to do |format|
      if @community_user.update(community_user_params)

SELECT  "community_users".* FROM "community_users" WHERE "community_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_community_user
      @community_user = CommunityUser.find(params[:id])