app/controllers/communities_controller.rb

SELECT "communities".* FROM "communities"
---
  def index
    @communities = Community.all

INSERT INTO "communities" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "text"], ["created_at", 2016-05-14 10:38:25 UTC], ["updated_at", 2016-05-14 10:38:25 UTC]]
---
  def create
    @community = Community.new(community_params)

    respond_to do |format|
      if @community.save

DELETE FROM "communities" WHERE "communities"."id" = $1  [["id", 3]]
---
  def destroy
    @community.destroy

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_community
      @community = Community.find(params[:id])