app/controllers/community_pages_controller.rb

  def index
    @community_pages = CommunityPage.all
---
SELECT "community_pages".* FROM "community_pages"

  def create
    @community_page = CommunityPage.new(community_page_params)

    respond_to do |format|
      if @community_page.save
---
INSERT INTO "community_pages" ("page_id", "community_id", "ismain", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["page_id", 1], ["community_id", 1], ["ismain", 0], ["created_at", 2016-05-21 10:20:56 UTC], ["updated_at", 2016-05-21 10:20:56 UTC]]

  def update
    respond_to do |format|
      if @community_page.update(community_page_params)
---
UPDATE "community_pages" SET "page_id" = $1, "community_id" = $2, "updated_at" = $3 WHERE "community_pages"."id" = $4  [["page_id", 1], ["community_id", 1], ["updated_at", 2016-05-14 11:44:25 UTC], ["id", 1]]

    def set_community_page
      @community_page = CommunityPage.find(params[:id])
---
SELECT  "community_pages".* FROM "community_pages" WHERE "community_pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]