app/controllers/groups_controller.rb

INSERT INTO "groups" ("title", "course", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "new1"], ["course", 1], ["semester", 1], ["created_at", 2016-04-30 15:28:25 UTC], ["updated_at", 2016-04-30 15:28:25 UTC]]
---
  def create
    @group = Group.new(group_params)
    if params.has_key?(:group) and params[:group].has_key?(:plans)
      @gp = params[:group][:plans].map{ |gp| gp.to_i } - [0]
    end
    if @group.save

DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 3]]
---
  def destroy
    @group.destroy