app/controllers/messages_controller.rb

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("header", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["header", "eeeee"], ["text", "1. rfrg\r\n2. frgr\r\n3. rgrgt"], ["created_at", 2016-04-16 14:17:36 UTC], ["updated_at", 2016-04-16 14:17:36 UTC]]
---
  def create
    @message = Message.new(message_params)
    if params.has_key?(:message) and params[:message].has_key?(:users)
      @mu = params[:message][:user].map{ |mu| sg.to_i } - [0]
    end
    if @message.save