app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
        s = Subject.where(id: params[:subject_id]).first
        ps = PageSubject.create(page: @page, subject: s) if s.present?
        format.html {
          if (@community = @page.community_pages.first).present?
---
INSERT INTO "pages" ("visibility", "header", "contents", "alias", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 ORDER BY "subjects"."id" ASC LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "community_pages".* FROM "community_pages" WHERE "community_pages"."page_id" = $1 ORDER BY "community_pages"."id" ASC LIMIT $2  [["page_id", 5], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @page.update(page_params)
        format.html {
          if (@community = @page.community_pages.first).present?
---
UPDATE "pages" SET "header" = $1, "contents" = $2, "alias" = $3, "updated_at" = $4 WHERE "pages"."id" = $5  [["header", "Название заголовка первой страницы"], ["contents", "<h1> Текст</h1>\r\n                  <b>Текст1</b>  "], ["alias", "псевдоним1"], ["updated_at", 2016-05-20 21:24:29 UTC], ["id", 1]]
SELECT  "community_pages".* FROM "community_pages" WHERE "community_pages"."page_id" = $1 ORDER BY "community_pages"."id" ASC LIMIT $2  [["page_id", 6], ["LIMIT", 1]]

  def destroy
    @page.destroy
---
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 2]]

    def set_page
      @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]