app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def create
    @plan = Plan.new(plan_params)

    if params.has_key?(:plan) and params[:plan].has_key?(:groups)
      @sg = params[:plan][:group].map{ |sg| sg.to_i } - [0]
    end
    if params.has_key?(:subject)
      @ss = params[:subject].map{ |ss| ss.to_i} - [0]
    end
    raise @ss.inspect
    if @plan.save
      if @sg.kind_of?(Array)
        @plan.group_plans.delete_all
        @sg.each do |gr_id|
          GroupPlan.create(group_id: gr_id.to_i, plan: @plan)
---
INSERT INTO "plans" ("code", "title", "level", "form_of_study", "university_id", "created_at", "updated_at", "training_period_start", "training_period_finish") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "group_plans" ("group_id", "plan_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["plan_id", 1], ["created_at", 2016-04-30 15:16:09 UTC], ["updated_at", 2016-04-30 15:16:09 UTC]]

  def update
    if params.has_key?(:plan) and params[:plan].has_key?(:groups)
      @sg = params[:plan][:groups].map{ |sg| sg.to_i } - [0]
    end
    if params.has_key?(:subject)
      @ss = params[:subject].map{ |ss| ss.to_i} - [0]
    end

    if @plan.update(plan_params)
      if @sg.kind_of?(Array)
        @plan.group_plans.delete_all
        @sg.each do |gr_id|
          GroupPlan.create(group_id: gr_id.to_i, plan: @plan)
        end
      end
      if @ss.kind_of?(Array)
        @plan.plan_subjects.delete_all
        @ss.each do |ss_id|
          PlanSubject.create(subject_id: ss_id.to_i, plan: @plan)
        end
      end
    end

    respond_to do |format|
      if @plan.update(plan_params)
---
INSERT INTO "plan_subjects" ("plan_id", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["plan_id", 1], ["subject_id", 5], ["created_at", 2016-04-23 18:05:47 UTC], ["updated_at", 2016-04-23 18:05:47 UTC]]
UPDATE "group_plans" SET "plan_id" = NULL WHERE "group_plans"."plan_id" = $1  [["plan_id", 1]]
UPDATE "plan_subjects" SET "plan_id" = NULL WHERE "plan_subjects"."plan_id" = $1  [["plan_id", 1]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]