app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    if params.has_key?(:student) and params[:student].has_key?(:groups)
      @sg = params[:student][:groups].map{ |sg| sg.to_i } - [0]
    end
    if @student.save
      if @sg.kind_of?(Array)
        @student.group_students.delete_all
        @sg.each do |gr_id|
          GroupStudent.create(group_id: gr_id.to_i, student: @student)
---
INSERT INTO "students" ("last_name", "first_name", "second_name", "b_date", "passport_id", "passport_series", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "group_students" ("group_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["group_id", 2], ["student_id", 1], ["created_at", 2016-05-20 20:40:51 UTC], ["updated_at", 2016-05-20 20:40:51 UTC]]