app/controllers/subjects_controller.rb

INSERT INTO "subjects" ("title", "s_type", "type_of_reporting", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Русский язык"], ["s_type", "лекция"], ["type_of_reporting", 0], ["created_at", 2016-04-23 17:16:19 UTC], ["updated_at", 2016-04-23 17:16:19 UTC]]
---
  def create
    @subject = Subject.new(subject_params)
    if params.has_key?(:subject) and params[:subject].has_key?(:teachers)
      @st = params[:subject][:teachers].map{ |st| st.to_i } - [0]
    end
    if @subject.save