app/controllers/talks_controller.rb

SELECT "talks".* FROM "talks"
---
  def index
    @talks = Talk.all

INSERT INTO "talks" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Домашнее задание"], ["created_at", "2016-04-15 00:04:21.913264"], ["updated_at", "2016-04-15 00:04:21.913264"]]
---
  def create
    @talk = Talk.new(talk_params)

    respond_to do |format|
      if @talk.save

SELECT  "talks".* FROM "talks" WHERE "talks"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_talk
      @talk = Talk.find(params[:id])