app/controllers/universities_controller.rb

  def index
    @universities = University.all
---
SELECT  "universities".* FROM "universities" ORDER BY "universities"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @university = University.new(university_params)

    respond_to do |format|
      if @university.save
---
INSERT INTO "universities" ("name", "full_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Национальный исследовательский ядерный университет \"МИФИ\""], ["full_name", "НИЯУ МИФИ"], ["created_at", 2016-04-23 15:18:17 UTC], ["updated_at", 2016-04-23 15:18:17 UTC]]

  def destroy
    @university.destroy
---
DELETE FROM "universities" WHERE "universities"."id" = $1  [["id", 3]]

    def set_university
      @university = University.find(params[:id])
---
SELECT  "universities".* FROM "universities" WHERE "universities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]