app/views/application/_navbar_top.html.haml

        %ul.dropdown-menu{role: 'menu'}
          - University.order(:name).to_a.each do |u|
---
SELECT "universities".* FROM "universities"  ORDER BY "universities"."name" ASC

        %ul.dropdown-menu{role: 'menu'}
          - RoleUser.where(user_id: @current_user.try(:id)).includes(:role).order('roles.name').to_a.each do |r|
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]