app/views/communities/show.html.haml

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              .list-group-item
                =cp.page.header
                .pull-right

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 AND "role_users"."id" = $2 ORDER BY "role_users"."id" ASC LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
SELECT "community_users".* FROM "community_users" WHERE "community_users"."community_id" = $1  [["community_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          .list-group
            -@community.community_users.sort.each do |cu|
              =link_to(cu.user, class: 'list-group-item') do
                -if cu.user.student.present?
                  .col-md-1{style: "text-align: center;"}