app/views/plans/_form.html.haml

          .row
            =link_to "Добавить еще дисциплину", add_one_more_plans_path(i: f.object.subjects.size, object: :subject), remote: true, id: "one_more_subject"
---
SELECT "subjects".* FROM "subjects" INNER JOIN "plan_subjects" ON "subjects"."id" = "plan_subjects"."subject_id" WHERE "plan_subjects"."plan_id" = $1  [["plan_id", 1]]

          =f.label :groups
          -f.object.groups.each_with_index do |g, i|
            .row
              .col-md-12
                .form-group
---
SELECT "groups".* FROM "groups" INNER JOIN "group_plans" ON "groups"."id" = "group_plans"."group_id" WHERE "group_plans"."plan_id" = $1  [["plan_id", 1]]