app/views/plans/index.html.haml

        %td= plan.training_period_finish
        %td= raw(plan.groups.map{ |g| link_to(g.title, group_path(g)) }.join(', '))
        %td= raw(plan.subjects.map{ |s| link_to(s.title, group_path(s)) }.join(', '))
---
SELECT "groups".* FROM "groups" INNER JOIN "group_plans" ON "groups"."id" = "group_plans"."group_id" WHERE "group_plans"."plan_id" = $1  [["plan_id", 1]]
SELECT "subjects".* FROM "subjects" INNER JOIN "plan_subjects" ON "subjects"."id" = "plan_subjects"."subject_id" WHERE "plan_subjects"."plan_id" = $1  [["plan_id", 1]]