app/views/plans/show.html.haml

  %ul
    - @plan.groups.each do |gr|
---
SELECT "groups".* FROM "groups" INNER JOIN "group_plans" ON "groups"."id" = "group_plans"."group_id" WHERE "group_plans"."plan_id" = $1  [["plan_id", 1]]

  %ul
    - @plan.subjects.each do |gs|
---
SELECT "subjects".* FROM "subjects" INNER JOIN "plan_subjects" ON "subjects"."id" = "plan_subjects"."subject_id" WHERE "plan_subjects"."plan_id" = $1  [["plan_id", 1]]